export const features = [
  {
    id: 1,
    icon: "/icons/icon3.png",
    title: "بنك أسئلة واختبارات وزارة سابقة",
    description: " آلية حل امتحانات السنوات السابقة مع تصحيح تلقائي وإظهار طريقة الحل النموذجية خطوة بخطوة."
  },
  {
    id: 2,
    icon: "/icons/icon2.png",
    title: "محتوى مكيّف ومصمّم خصيصاً للمنهاج",
    description: "تغطية شاملة ودقيقة لجميع المواد والأفرع (علمي، أدبي، ريادي...) مع تركيز خاص على نمط أسئلة الوزارة والامتحانات النهائية"
  },
  {
    id: 3,
    icon: "/icons/icon1.png",
    title: "ملخصات وبطاقات مراجعة سريعة",
    description: "تركيز على القوانين، والمفاهيم، والقواعد الأساسية للمراجعة قبل الامتحانات مباشرة."
  },
  {
    id: 4,
    icon: "/icons/icon4.png",
    title: "خطط دراسية وجداول مخصصة",
    description: " إمكانية تنظيم الوقت وإعداد جدول دراسي يناسب كل طالب بناءً على مستواه والوقت المتبقي حتى امتحانات التوجيهي."
  }
];

export const testimonials = [
  {
    id: 1,
    name: "هشام مروان",
    track: "توجيهي- الفرع الريادة",
    avatar: "/avatars/page5.png",
    text: "كانت مادة الرياضيات المالية رُعبي الأكبر وشعرتُ بالعجز أمام المعادلات والتحليلات، لكنني واجهتُ خوفي بخطة بسيطة: حلُّ سؤالٍ واحد يومياً بتمهل. بالاستمرار والتركيز، دخلتُ الامتحان النهائي بثقة وحصلتُ على العلامة الكاملة، ليرتفع معدلي إلى 96.5% ويتحول خوفي إلى فخر كبير",
    percentage: "96.5%"
  },
  {
    id: 2,
    name: "علا احمد",
    track: "توجيهي- الفرع العلمي",
    avatar: "/avatars/page2.png",
    text: "كانت مادة الفيزياء رُعبي الأكبر وشعرتُ بالعجز أمام القوانين والتجارب، لكنني واجهتُ خوفي بخطة بسيطة: حلُّ مسألةٍ واحدة يومياً بتمهل. بالاستمرار والتركيز، دخلتُ الامتحان النهائي بثقة وحصلتُ على العلامة الكاملة، ليرتفع معدلي إلى 96.5% ويتحول خوفي إلى فخر كبير",
    percentage: "96.5%"
  },
  {
    id: 3,
    name: "ادم ياسين",
    track: "توجيهي- الفرع الريادة",
    avatar: "/avatars/page3.png",
    text: "كانت مادة الاقتصاد رُعبي الأكبر وشعرتُ بالعجز أمام المفاهيم المالية، لكنني واجهتُ خوفي بخطة بسيطة: فهمُ درسٍ واحد يومياً بتمهل. بالاستمرار والتركيز، دخلتُ الامتحان النهائي بثقة وحصلتُ على العلامة الكاملة، ليرتفع معدلي إلى 96.5% ويتحول خوفي إلى فخر كبير",
    percentage: "96.5%"
  },
  {
    id: 4,
    name: "احمد ابراهيم",
    track: "توجيهي- الفرع الأدبي",
    avatar: "/avatars/page4.png",
    text: "قبل الامتحانات، شعرتُ بالضياع والضغط أمام زخم المواد الأدبية، لكنني واجهتُ ذلك بخطة محكمة: تلخيصُ وفهمُ درسٍ واحد يومياً بتمهل وتركيز. بالاستمرار والتوكل على الله، دخلتُ الامتحان بثقة وحصلتُ على معدل 97.8% في الفرع الأدبي، لتحقيق حلمي الذي طال انتظاره",
    percentage: "97.8%"
  },
  {
    id: 5,
    name: "فاطمة محمود",
    track: "توجيهي- الفرع العلمي",
    avatar: "/avatars/page1.png",
    text: "كانت مادة الرياضيات رُعبي الأكبر وشعرتُ بالعجز أمام المعادلات، لكنني واجهتُ خوفي بخطة بسيطة: حلُّ سؤالٍ واحد يومياً بتمهل. بالاستمرار والتركيز، دخلتُ الامتحان النهائي بثقة وحصلتُ على العلامة الكاملة، ليرتفع معدلي إلى 96.5% ويتحول خوفي إلى فخر كبير",
    percentage: "96.5%"
  },
  {
    id: 6,
    name: "سارة احمد",
    track: "توجيهي- الفرع الشرعي",
    avatar: "/avatars/page6.png",
    text: "كانت مادة الفقه رُعبي الأكبر وشعرتُ بالعجز أمام الأحكام والدلائل، لكنني واجهتُ خوفي بخطة بسيطة: فهمُ مسألةٍ واحدة يومياً بتمهل. بالاستمرار والتركيز، دخلتُ الامتحان النهائي بثقة وحصلتُ على العلامة الكاملة، ليرتفع معدلي إلى 96.5% ويتحول خوفي إلى فخر كبير",
    percentage: "96.5%"
  },
  {
    id: 7,
    name: "محمد علي",
    track: "توجيهي- الفرع الأدبي",
    avatar: "/avatars/page7.png",
    text: "كانت مادة التاريخ رُعبي الأكبر وشعرتُ بالفشل في الفرع الأدبي، لكنني قررت مواجهة خوفي بخطة بسيطة: فهمُ حدثٍ واحد يومياً بتمهل. بالاستمرار والتركيز، دخلتُ الامتحان النهائي بثقة وحصلتُ على العلامة الكاملة، ليرتفع معدلي إلى 96.5% ويتحول خوفي إلى فخر كبير",
    percentage: "96.5%"
  }
];